// Напишите программу, которая принимает на вход цифру, обозначающую день недели
// и проверяет, является ли этот день выходным.
Console.WriteLine("Введите любое число : ");
int x = int.Parse (Console.ReadLine());
if  (x == 6 || x == 7){Console.WriteLine("Выходной");}
else {Console.WriteLine("Будний");}

